app/controllers/companies_controller.rb

  def index

    @companies = Company.all
---
SELECT * FROM "companies"

  def show
    @company = Company.find(params[:id])
---
SELECT * FROM "companies" WHERE ("companies"."id" = 3)

  def edit
    @company = Company.find(params[:id])
---
SELECT * FROM "companies" WHERE ("companies"."id" = 3)

  def create
    @company = current_user.companies.build(params[:company])
    logger.debug params.to_yaml
    # logger.debug @company.code
    @company.code.upcase!

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("created_at", "code", "updated_at", "description") VALUES('2010-03-03 02:25:19.187500', E'CM', '2010-03-03 02:25:19.187500', E'Cat Mountain') RETURNING "id"

  def update
    @company = Company.find(params[:id])

		# logger.debug "Hello"
    # logger.debug params.to_yaml
    # logger.debug "Hello"
    # logger.debug params["company"]["code"].upcase!
    # params["company"["code"]].to_upper!
    code_to_upper(params)

    respond_to do |format|
      if @company.update_attributes(params[:company])
---
SELECT * FROM "companies" WHERE ("companies"."id" = 2)
UPDATE "companies" SET "updated_at" = '2010-03-08 03:34:15.557323', "description" = E'Mindfire ' WHERE "id" = 2