app/controllers/computers_controller.rb

SELECT * FROM "computers"
---
  def index
    @computers = Computer.all