app/controllers/computer_allocations_controller.rb

  def index
    @computer_allocations = ComputerAllocation.all
---
SELECT * FROM "computer_allocations"