app/controllers/lookups_controller.rb

SELECT * FROM "lookups"
---
  def index
    @lookups = Lookup.all