app/controllers/offices_controller.rb

  def index
    @offices = Office.all
---
SELECT * FROM "offices"

  def show
    @office = Office.find(params[:id])
		@site_code = Site.find(@office.site_id)
		@company_desc = Company.find(@office.company_id)
---
SELECT * FROM "offices" WHERE ("offices"."id" = 1)
SELECT * FROM "sites" WHERE ("sites"."id" = 1)
SELECT * FROM "companies" WHERE ("companies"."id" = 4)

  def new
    @office = Office.new
		@sites = Site.all
		@companies = Company.all
---
SELECT * FROM "sites"
SELECT * FROM "companies"

  def create
    @office = Office.new(params[:office])

    respond_to do |format|
      if @office.save
---
INSERT INTO "offices" ("created_at", "code", "updated_at", "company_id", "description", "site_id") VALUES('2010-03-23 02:19:19.364880', E'first', '2010-03-23 02:19:19.364880', 2, E'first company', 2) RETURNING "id"