app/controllers/sites_controller.rb

SELECT * FROM "sites"
---
  def index
    @sites = Site.all

SELECT * FROM "sites" WHERE ("sites"."id" = 1)
---
  def show
    @site = Site.find(params[:id])

SELECT * FROM "sites" WHERE ("sites"."id" = 1)
---
  def edit
    @site = Site.find(params[:id])

INSERT INTO "sites" ("address1", "city", "address2", "created_at", "code", "zipcode", "updated_at", "state") VALUES(E'32 Second Ave', E'New York', E'', '2010-03-19 01:37:59.576048', E'NY', E'02111', '2010-03-19 01:37:59.576048', E'NY') RETURNING "id"
---
  def create
    @site = Site.new(params[:site])

    respond_to do |format|
      if @site.save