app/controllers/softwares_controller.rb

  def index
    @softwares = Software.all
---
SELECT * FROM "softwares"

  def show
    @software = Software.find(params[:id])
---
SELECT * FROM "softwares" WHERE ("softwares"."id" = 1)

  def edit
    @software = Software.find(params[:id])
---
SELECT * FROM "softwares" WHERE ("softwares"."id" = 1)