app/controllers/ticket_actions_controller.rb

SELECT * FROM "ticket_actions"
---
  def index
    @ticket_actions = TicketAction.all