app/controllers/tickets_controller.rb

SELECT * FROM "tickets"
---
  def index
    @tickets = Ticket.all

SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)
---
  def show
    @ticket = Ticket.find(params[:id])

SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)
---
  def edit
    @ticket = Ticket.find(params[:id])