app/controllers/ticket_actions_controller.rb

SELECT * FROM "ticket_actions" WHERE ("ticket_actions"."id" = 0)
SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)
---
  def show
    @ticket_action = @ticket.ticket_actions.find(params[:id])

SELECT * FROM "ticket_actions" WHERE ("ticket_actions"."id" = 2)
---
  def edit
    @ticket_action = TicketAction.find(params[:id])

INSERT INTO "ticket_actions" ("created_at", "updated_at", "ticket_id", "add_user_id", "action_desc") VALUES('2010-04-09 01:47:08.506989', '2010-04-09 01:47:08.506989', 1, NULL, E'ewrdsfsd') RETURNING "id"
---
  def create
    @ticket_action = TicketAction.new(params[:ticket_action])

    respond_to do |format|
      if @ticket_action.save

SELECT * FROM "ticket_actions" WHERE ("ticket_actions"."id" = 2)
UPDATE "ticket_actions" SET "updated_at" = '2010-04-14 02:18:23.469230', "action_desc" = E'This is to be a longer note. Just to see how it formats in the ta list. What would happen if I made it really long. And longer.' WHERE "id" = 9
---
  def update
    @ticket_action = TicketAction.find(params[:id])

    respond_to do |format|
      if @ticket_action.update_attributes(params[:ticket_action])

SELECT * FROM "ticket_actions" WHERE ("ticket_actions"."id" = 6)
DELETE FROM "ticket_actions" WHERE "id" = 6
---
  def destroy
    @ticket_action = TicketAction.find(params[:id])
    @ticket_action.destroy

SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)
---
  def find_ticket
    @ticket = Ticket.find(params[:ticket_id])