app/controllers/users_controller.rb

  def index
		@users = User.find(:all, :order => :name)
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password", "admin", "last_name", "first_name", "email") VALUES(E'bc', E'537009840.788549857886756', '2010-04-30 02:34:01.744833', '2010-04-30 02:34:01.744833', E'72ea1084190986e6831c52a48229b2575d6d5269', 'f', E'', E'', E'') RETURNING "id"

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-04-30 01:53:10.628634', "email" = E'', "last_name" = E'Chouinard', "first_name" = E'Dean' WHERE "id" = 1

  def destroy
    @user = User.find(params[:id])
		begin
			@user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 3)
DELETE FROM "users" WHERE "id" = 3